[About Language File]
Version=12.17.0
Date=05.02.2017
Author=Lasse Rautiainen
Email=lasse@bonecode.com
Comments=If you find translation errors, let me know. Thank you.

[MainForm]
ActionDirectoryContextMenu:h=Context menu
ActionDirectoryContextMenu=C&ontext menu
ActionDirectoryDelete:h=Delete a file or directory
ActionDirectoryDelete=&Delete
ActionDirectoryFindInFiles:h=Search for a string in multiple files
ActionDirectoryFindInFiles=&Find in files...
ActionDirectoryProperties:h=See the file/directory properties
ActionDirectoryProperties=&Properties...
ActionDirectoryRefresh:h=Refresh files
ActionDirectoryRefresh=&Refresh
ActionDirectoryRename:h=Rename a file or directory
ActionDirectoryRename=Re&name
ActionDocument=&Document
ActionDocumentFormat=Format
ActionDocumentFormatSQL:h=Format SQL
ActionDocumentFormatSQL=Format SQL
ActionDocumentFormatXML:h=Format XML
ActionDocumentFormatXML=&Format XML
ActionDocumentFormatJSON:h=Format JSON
ActionDocumentFormatJSON=&Format JSON
ActionDocumentFormatJSONMinify=Minify
ActionDocumentFormatJSONIndent2=Indent 2
ActionDocumentFormatJSONIndent3=Indent 3
ActionDocumentFormatJSONIndent4=Indent 4
ActionDocumentHTMLExport=HTML Export
ActionDocumentInfo:h=Line, word, and character count
ActionDocumentInfo=&Info...
ActionDocumentViewInBrowser:h=View current document in default browser
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&View in browser
ActionEdit=&Edit
ActionEditCopy:h=Copy the selection and put it on the clipboard
ActionEditCopy:s=Ctrl+C
ActionEditCopy=C&opy
ActionEditCut:h=Cut the selection and put it on the clipboard
ActionEditCut:s=Ctrl+X
ActionEditCut=&Cut
ActionEditIndentDecrease:h=Decrease indent
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=&Decrease
ActionEditDelete=D&elete
ActionEditDeleteEndOfLine:h=Delete end of line
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=&End of line
ActionEditDeleteLine:h=Delete line
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&Line
ActionEditDeleteWhitespace:h=Remove all whitespace from selected text
ActionEditDeleteWhitespace=W&hitespace
ActionEditDeleteWord:h=Delete word
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&Word
ActionEditIndentIncrease:h=Increase indent
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=Increase
ActionEditIndent=I&ndent
ActionEditInsert=Insert
ActionEditInsertHexColor=Hex color
ActionEditInsertHexColor:s=Shift+Ctrl+C
ActionEditInsertDateTime:h=Insert date and time
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&Date and time
ActionEditInsertLine:h=Insert line
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&Line
ActionEditInsertTag:h=Insert HTML/XML tags
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XML tags...
ActionEditPaste:h=Insert clipboard contents
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&Paste
ActionEditRedo:h=Redo the previously undone action
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&Redo
ActionEditSelectAll:h=Select all
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&Select all
ActionEditSort=Sor&t
ActionEditSortAsc:h=Sort ascending
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&Ascending
ActionEditSortDesc:h=Sort descending
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&Descending
ActionEditSortRandom=Random
ActionEditSortRandom:s=Random sort
ActionEditToggleCase:h=Toggle case
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=To&ggle case
ActionEditToggleCaseAlternating:h=Toggle alternating case
ActionEditToggleCaseAlternating=Alternating
ActionEditToggleCaseLower:h=Toggle lower case
ActionEditToggleCaseLower=Lower
ActionEditToggleCaseSentence:h=Toggle sentence case
ActionEditToggleCaseSentence=Sentence
ActionEditToggleCaseTitle:h=Toggle title case
ActionEditToggleCaseTitle=Title
ActionEditToggleCaseUpper:h=Toggle upper case
ActionEditToggleCaseUpper=Upper
ActionEditUndo:h=Undo the last action
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&Undo
ActionFile=&File
ActionFileClose:h=Close the active document
ActionFileClose:s=Ctrl+F4
ActionFileClose=&Close
ActionFileCloseAll:h=Close all open files
ActionFileCloseAll=C&lose all
ActionFileCloseAllOther:h=Close all other pages
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=Clos&e all other
ActionFileExit:h=Quit the application
ActionFileExit:s=Alt+F4
ActionFileExit=E&xit
ActionFileNew:h=Create a new document
ActionFileNew:s=Ctrl+N
ActionFileNew=&New
ActionFileOpen:h=Open an existing document
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&Open...
ActionFilePrint:h=Print the active document
ActionFilePrint:s=Ctrl+P
ActionFilePrint=&Print...
ActionFilePrintPreview:h=Preview the active document
ActionFilePrintPreview=Pr&int preview...
ActionFileProperties:h=See the file properties
ActionFileProperties=Pr&operties...
ActionFileReopen=&Reopen
ActionFileReopenProperties=Properties...
ActionFileSave:h=Save the active document
ActionFileSave:s=Ctrl+S
ActionFileSave=&Save
ActionFileSaveAll:h=Save all documents
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=Sa&ve all
ActionFileSaveAs:h=Save the active document with a new name
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=S&ave as...
ActionFileSelectFromDirectory:h=Select the file from the active directory
ActionFileSelectFromDirectory=Select from directory
ActionHelp=&Help
ActionHelpAboutEditBone:h=Display information about EditBone
ActionHelpAboutEditBone=&About EditBone
ActionHelpCheckForUpdates:h=Check for updates
ActionHelpCheckForUpdates=&Check for updates
ActionHelpVisitHomepage:h=Visit EditBone homepage - http://www.bonecode.com/
ActionHelpVisitHomepage=&Visit homepage
ActionMacro=Macro
ActionMacroOpen:h=Open an existing macro
ActionMacroOpen=&Open...
ActionMacroPause:h=Pause a macro
ActionMacroPause:s=Shift+Ctrl+R
ActionMacroPause=&Pause
ActionMacroPlayback:h=Playback the macro
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&Playback
ActionMacroRecord:h=Record a macro
ActionMacroRecord:s=Shift+Ctrl+R
ActionMacroRecord=&Record
ActionMacroSaveAs:h=Save the macro with a new name
ActionMacroSaveAs=S&ave as...
ActionMacroStop:h=Stop the macro recording
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&Stop
ActionOutputCloseAllOtherPages:h=Close all other
ActionOutputCloseAllOtherPages=Close A&ll Other Pages
ActionOutputCopyAllToClipboard:h=Copy all to clipboard
ActionOutputCopyAllToClipboard=C&opy all to clipboard
ActionOutputCopySelectedToClipboard:h=Copy selected to clipboard
ActionOutputCopySelectedToClipboard=Copy selected to clipboard
ActionOutputOpenAll:h=Open all files
ActionOutputOpenAll=&Open all
ActionOutputOpenSelected:h=Open selected files
ActionOutputOpenSelected=&Open selected
ActionOutputClose:h=Close current page
ActionOutputClose=&Close
ActionOutputCloseAll:h=Close all pages
ActionOutputCloseAll=Close &all
ActionOutputSelectAll:h=Select all files
ActionOutputSelectAll=Select all
ActionOutputUnselectAll:h=Unselect all files
ActionOutputUnselectAll=Unselect all
ActionSearch=&Search
ActionSearchClearBookmarks:h=Clear all bookmarks
ActionSearchClearBookmarks=Clear &bookmarks
ActionSearchClose:h=Close
ActionSearchFindAll=Find all
ActionSearchFindAll:h=Find all matching texts
ActionSearchFindInFiles:h=Search for a string in multiple files
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=&Find in files...
ActionSearchFindNext:h=Find the next matching text
ActionSearchFindNext:s=F3
ActionSearchFindNext=Find &next
ActionSearchFindPrevious:h=Find the previous matching text
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=Find &previous
ActionGotoNextBookmark=Next
ActionGotoNextBookmark:h=Go to next bookmark
ActionGotoNextBookmark:s=F2
ActionGotoPreviousBookmark=Previous
ActionGotoPreviousBookmark:h=Go to previous bookmark
ActionGotoPreviousBookmark:s=Shift+F2
ActionSearchGoToBookmarks:h=Go to bookmarks
ActionSearchGoToBookmarks=Go to bookmarks
ActionSearchGoToLine:h=Go to line
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=Go to line
ActionSearchOptions:h=Search options
ActionSearchReplace:h=Replace the specified text with different text
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&Replace...
ActionSearchSearchButton:h=Search the specified text
ActionSearchSearch:s=Ctrl+F
ActionSearchSearchButton=&Search...
ActionSearchToggleBookmark:h=Set or clear bookmark at current line. Bookmarks can be also set by using Ctrl+Shift+1..9. Go to bookmark by using Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&Toggle bookmark
ActionSearchToggleBookmarks:h=Toggle bookmarks
ActionSearchToggleBookmarks=T&oggle bookmarks
ActionSearchEngine:h=Select search engine
ActionSearchCaseSensitive:h=Case sensitive
ActionSearchInSelection:h=In selection
ActionToolbarMenuLanguage=&Language
ActionToolbarMenuSkin=S&kin...
ActionToolbarMenuView=&View
ActionTools=&Tools
ActionToolsCharacterMap:h=Insert unicode characters to active document by double-clicking
ActionToolsCharacterMap=&Unicode character map...
ActionToolsClipboardHistory=Clipboard history
ActionToolsCompareFiles:h=Compare files
ActionToolsCompareFiles=&Compare files...
ActionToolsConvert:h=Convert between numerical units
ActionToolsConvert=C&onvert...
ActionToolsLanguageEditor:h=Language editor
ActionToolsLanguageEditor=&Language editor...
ActionToolsOptions:h=Set options
ActionToolsOptions=&Options...
ActionToolsSelectForCompare:h=Select document for compare
ActionToolsSelectForCompare=Select for compare...
ActionView=&View
ActionViewCloseDirectory:h=Close the active directory
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&Close directory
ActionViewColorSelection:h=Show or hide the color selection
ActionViewColorSelection=Color
ActionViewDirectory:h=Show or hide the directory
ActionViewDirectory=&Directory
ActionViewEditDirectory:h=Edit the active directory
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&Edit directory...
ActionViewEncodingSelection:h=Show or hide the encoding selection
ActionViewEncodingSelection=Encodin&g
ActionViewFiles:h=Search files from the selected directory and its subdirectories
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&Files...
ActionViewFold=Fold
ActionViewFoldAll=Fold all
ActionViewFoldAll:h=Fold all
ActionViewFoldAllDownFromActiveLine=Fold all down from active line
ActionViewFoldAllDownFromActiveLine:h=Fold all down from active line
ActionViewFoldAllDownFromSelectedLine=Fold all down from selected line
ActionViewFoldAllDownFromSelectedLine:h=Fold all down from selected line
ActionViewFoldAllUpFromActiveLine=Fold all up from active line
ActionViewFoldAllUpFromActiveLine:h=Fold all up from active line
ActionViewFoldAllUpFromSelectedLine=Fold all up from selected line
ActionViewFoldAllUpFromSelectedLine:h=Fold all up from selected line
ActionViewFoldSelected=Fold selected
ActionViewFoldSelected:h=Fold selected
ActionViewUnfold=Unfold
ActionViewUnfoldAll=Unfold all
ActionViewUnfoldAll:h=Unfold all
ActionViewUnfoldAllDownFromActiveLine=Unfold all down from active line
ActionViewUnfoldAllDownFromActiveLine:h=Unfold all down from active line
ActionViewUnfoldAllDownFromSelectedLine=Unfold all down from selected line
ActionViewUnfoldAllDownFromSelectedLine:h=Unfold all down from selected line
ActionViewUnfoldAllUpFromActiveLine=Unfold all up from active line
ActionViewUnfoldAllUpFromActiveLine:h=Unfold all up from active line
ActionViewUnfoldAllUpFromSelectedLine=Unfold all up from selected line
ActionViewUnfoldAllUpFromSelectedLine:h=Unfold all up from selected line
ActionViewUnfoldSelected=Unfold selected
ActionViewUnfoldSelected:h=Unfold selected
ActionViewHighlighterSelection:h=Show or hide the highlighter selection
ActionViewHighlighterSelection=&Highlighter
ActionViewLineNumbers:h=Toggle line numbers
ActionViewLineNumbers=Line num&bers
ActionViewMainMenu:h=Show or hide the main menu
ActionViewMainMenu=Main menu
ActionViewMenuBar:h=Show or hide the menu bar
ActionViewMenuBar=Menu bar
ActionViewMiniMap:h=Show or hide the minimap
ActionViewMiniMap=Minimap
ActionViewNextPage:h=Go to next page
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&Next page
ActionViewOpenDirectory:h=Open a new directory
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&Open directory...
ActionViewOutput:h=Show or hide the output
ActionViewOutput=O&utput
ActionViewPreviousPage:h=Go to previous page
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&Previous page
ActionViewSelectionMode:h=Toggle selection mode. Also pressing Alt on editor will toggle selection mode.
ActionViewSelectionMode=Selection &mode
ActionViewSkinSelector=Skin selector
ActionViewSpecialChars:h=Toggle special characters
ActionViewSpecialChars=Spec&ial chars
ActionViewSplit:h=Split the document
ActionViewSplit=&Split
ActionViewSyncEdit=Sync edit
ActionViewSyncEdit:h=Show or hide synchronized editing
ActionViewSyncEdit:s=Shift+Ctrl+J
ActionViewStatusBar:h=Show or hide the status bar
ActionViewStatusBar=&Status bar
ActionViewToolbar:h=Show or hide the Toolbar
ActionViewToolbar=&Toolbar
ActionViewTitleBar=Title bar
ActionViewTitleBarFilename=Filename
ActionViewTitleBarFilename:h=Show or hide the title bar filename
ActionViewTitleBarFileList=File list
ActionViewTitleBarFileList:h=Show or hide the title bar file list
ActionViewWordWrap:h=Toggle word wrap
ActionViewWordWrap=&Word wrap
ActionViewXMLTree:h=Show or hide the XML tree
ActionViewXMLTree=&XML tree
ActionXMLTreeRefresh:h=Refresh XML tree
ActionXMLTreeRefresh=&Refresh
PanelDocument=Processing...

[AskYesOrNo]
ChangeColorFile=You are changing an original color file. Create a new modified color file?
CancelSearch=Cancel search, are you sure?
CloseDirectory=Close directory %s, are you sure?
DeleteDirectory=Delete directory %s, are you sure?
DeleteFile=Delete file %s, are you sure?
DeleteLine=Delete line, are you sure?
NewVersion=A new version %s of %s is available.%sWould you like to download it from the Internet?
RecordMacro=Record a new macro, are you sure?
ReplaceOccurence=Replace this occurence of '%s'?
SaveChanges=Save changes?
SearchMatchNotFound=Search match not found.%sRestart search from the beginning of the file?
SearchStringNotFound=Search string '%s' not found

[Message]
CannotFindString=Cannot find the string '%s'
DocumentStatistics=Line count: %d%sWord count: %d%sCharacter count: %d
LatestVersion=You are using the latest version.
SelectFilePathFromDirectory=Select file path from directory
NoDefaultPrinter=There is no default printer currently selected.

[ErrorMessage]
EnterPath=Enter path.
EnterTabName=Enter tab name.
FileNotFound=File '%s' not found.
PathNotExist=Path does not exist.
RootDirectoryNotExist=Root directory does not exist.

[WarningMessage]
FileAccessError=File %s access error.

[Constant]
AllFiles=All files
AllSkinsDownload=All skins download
Arrow=Arrow
AutoSave=Auto save
Block=Block
Bookmark=Bookmark
Bottom=Bottom
Circle=Circle
Color=Color
CompareFiles=Compare files
Confirmation=Confirmation
CountingFiles=Counting files...
DirectoryItems=Directory items
Document=Document
Dot=Dot
DownloadCancelling=Canceling...
DownloadDone=Done.
EditDirectory=Edit Directory
Encoding=Encoding
Enter=Enter
Error=Error
FileMaskItems=File mask items
FilesFound=%d file(s) have been found in %s
FooterLeft=Footer - left
FooterRight=Footer - right
GoToLine=Go to line
HalfBlock=Half block
HeaderLeft=Header - left
HeaderRight=Header - right
Hide=Hide
Highlighter=Highlighter
HorizontalLine=Horizontal line
Information=Information
Insert=Insert
InsertTags=Insert HTML/XML Tags
InvalidName=Invalid name
LanguageEditor=Language Editor - [%s]
Line=Line
MatchFound=%d match%s found
MatchFoundPluralExtension=es
Minute=min
Modified=Modified
Normal=Normal
OccurencesFound=%d occurence(s) have been found in %s
Open=Open
OpenDirectory=Open directory
Overwrite=Overwrite
Page=Page
Pilcrow=Pilcrow
Position=Position: %d
PreviewDocumentPage=Page: $PAGENUM$ of $PAGECOUNT$
PreviewPage= Page: %d of %d
PreviewPrintDocument=Print (%s)|Print the document on %s
PrintedBy=Printed by %s
RegularExpression=Regular expression
Rename=Do you want to rename %s to %s?
RenameFailed=%s rename failed
ReopenItems=Reopen items
RightMargin=Right margin
SaveAs=Save As
SearchFor=Search for '%s'
SearchItems=Search items
Second=s
SelectRootDirectory=Select root directory
Solid=Solid
Square=Square
TextToFindItems=Text to find items
ThinHorizontalLine=Thin horizontal line
ThinVerticalLine=Thin vertical line
Top=Top
TopLine=Top Line: %d
Triangle=Triangle
VersionInfoNotFound=Version info not found.
VerticalLine=Vertical line
Warning=Warning
Wildcard=Wildcard

[DialogConstant]
SMsgDlgAbort=&Abort
SMsgDlgAll=&All
SMsgDlgCancel=Cancel
SMsgDlgClose=&Close
SMsgDlgConfirm=Confirm
SMsgDlgError=Error
SMsgDlgHelp=&Help
SMsgDlgHelpHelp=Help
SMsgDlgHelpNone=No help available
SMsgDlgIgnore=&Ignore
SMsgDlgInformation=Information
SMsgDlgNo=&No
SMsgDlgNoToAll=N&o to All
SMsgDlgOK=OK
SMsgDlgRetry=&Retry
SMsgDlgWarning=Warning
SMsgDlgYes=&Yes
SMsgDlgYesToAll=Yes to &All

[ColorConstant]
SNameBlack=Black
SNameMaroon=Maroon
SNameGreen=Green
SNameOlive=Olive
SNameNavy=Navy
SNamePurple=Purple
SNameTeal=Teal
SNameGray=Gray
SNameSilver=Silver
SNameRed=Red
SNameLime=Lime
SNameYellow=Yellow
SNameBlue=Blue
SNameFuchsia=Fuchsia
SNameAqua=Aqua
SNameWhite=White
SNameMoneyGreen=Money green
SNameSkyBlue=Sky blue
SNameCream=Cream
SNameMedGray=Medium gray
SNameActiveBorder=Active border
SNameActiveCaption=Active caption
SNameAppWorkSpace=Application workspace
SNameBackground=Background
SNameBtnFace=Button face
SNameBtnHighlight=Button highlight
SNameBtnShadow=Button shadow
SNameBtnText=Button text
SNameCaptionText=Caption text
SNameDefault=Default
SNameGradientActiveCaption=Gradient active caption
SNameGradientInactiveCaption=Gradient inactive caption
SNameGrayText=Gray text
SNameHighlight=Highlight background
SNameHighlightText=Highlight text
SNameHotLight=Hot light
SNameInactiveBorder=Inactive border
SNameInactiveCaption=Inactive caption
SNameInactiveCaptionText=Inactive caption text
SNameInfoBk=Info background
SNameInfoText=Info text
SNameMenu=Menu background
SNameMenuBar=Menu bar
SNameMenuHighlight=Menu highlight
SNameMenuText=Menu text
SNameNone=None
SNameScrollBar=Scroll bar
SName3DDkShadow=3D dark shadow
SName3DLight=3D light
SNameWindow=Window background
SNameWindowFrame=Window frame
SNameWindowText=Window text
SColorBoxCustomCaption=Custom...

[FileTypes]
ActionScript=ActionScript files (*.as)
ASP=ASP files (*.asp)
Assembler 68HC11=68HC11 Assembler files (*.hc11;*.asc)
AutoIt v3=AutoIt files (*.au3)
AWK=AWK scripts (*.awk)
C#=C# files (*.cs)
C++=C++ files (*.cpp;*.hpp)
C=C files (*.c;*.h)
CoffeeScript=CoffeeScript files (*.coffee)
CSS=Cascading Stylesheet files (*.css)
D=D files (*.d;*.di)
Delphi Form Module=Delphi Form Module files (*.dfm)
Free Pascal=Free Pascal files (*.pp)
GLSL=GLSL files (*.glsl)
Go=Go files (*.go)
Groovy=Groovy files (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=HTML files (*.html;*.htm)
INI=INI files (*.ini;*.lng)
Inno Setup=Inno Setup files (*.iss)
Java=Java files (*.java)
JavaScript=JavaScript files (*.js)
JSON=JSON files (*.json)
LaTex=LaTex files (*.lat;*.tex;*.lex)
Lisp=Lisp files (*.lisp)
Lua=Lua files (*.lua)
Markdown=Markdown files (*.md)
MATLAB=MATLAB files (*.matlab)
MIME=MIME files (*.eml;*.mht)
MS-DOS Batch=MS-DOS Batch files (*.bat;*.cmd)
Objective-C=Objective-C files (*.m)
Object Pascal=Pascal files (*.pas;*.dpr;*.dpk)
OCaml=OCaml files (*.ml)
Perl=Perl files (*.pl;*.pm;*.cgi)
PHP=PHP files (*.php;*.class;*.inc)
PowerShell=PowerShell files (*.ps1)
Python=Python files (*.py)
Ruby=Ruby files (*.rb;*.rbw)
Rust=Rust files (*.rc)
Scala=Scala files (*.scala)
SQL - Standard=SQL files (*.sql)
Swift=Swift files (*.swift)
TclTk=Tcl/Tk files (*.tcl)
Text=Text files (*.txt)
TypeScript=TypeScript files (*.ts)
UnrealScript=UnrealScript files (*.uc)
Visual Basic=Visual Basic files (*.vb;*.bas)
XML=XML files (*.xml;*.xsd;*.dtd;*.dproj;*.groupproj)
XSL=XSL files (*.xsl;*.xslt)
Macro=Macro files (*.mcr)|*.mcr
Language=Language files (*.lng)|*.lng
Zip=Zip files (*.zip)|*.zip

[ClipboardHistoryDialog]
Caption=Clipboard history
ActionCopyToClipboard=Copy to clipboard
ActionInsertInEditor=Insert into editor
ActionClearAll=Clear all

[ChangedFilesDialog]
VirtualDrawTree:0=File
VirtualDrawTree:1=Path

[ConfirmReplaceDialog]
ButtonCancel=Cancel
ButtonNo=&No
ButtonYes=&Yes
ButtonYesToAll=Yes to &all
Caption=Confirm replace

[DownloadURLDialog]
ButtonCancel=Cancel
Caption=Download

[FindInFilesDialog]
ButtonCancel=Cancel
ButtonFind=&Find
Caption=Find in files
StickyLabelCaseSensitive=Case sensitive
StickyLabelIncludeSubdirectories=Include subdirectories
ComboBoxDirectory=Directory
ComboBoxFileMask=File mask
ComboBoxTextToFind=Text to find
GroupBoxOptions=Options
GroupBoxSearchDirectoryOptions=Search directory options
StickyLabelWholeWordsOnly=Whole words only
ActionSearchEngine=Select search engine

[InputQueryDialog]
ButtonOK=OK
ButtonCancel=Cancel

[ItemListDialog]
ActionInsert=Insert
ActionInsert:h=Insert item
ActionDelete=Delete
ActionDelete:h=Delete item
ActionClearAll=Clear all
ActionClearAll:h=Clear all items
ActionMoveUp=Move up
ActionMoveUp:h=Move selected item up
ActionMoveDown=Move down
ActionMoveDown:h=Move selected item down
ActionSort=Sort
ActionSort:h=Sort items

[SearchOptionsDialog]
ButtonCancel=Cancel
ButtonOK=OK
StickyLabelBeepIfSearchStringNotFound=Beep if search string not found
StickyLabelEntireScope=Entire scope
StickyLabelHighlightResult=Highlight results
StickyLabelSearchOnTyping=Search on typing
StickyLabelShowSearchMatchNotFound=Show search match not found
StickyLabelShowSearchStringNotFound=Show search string not found
StickyLabelWholeWordsOnly=Whole words only
StickyLabelWrapAround=Wrap around

[OptionsToolbarItemsDialog]
ButtonAdd=Add
ButtonCancel=Cancel
Caption=Select items
VirtualDrawTreeAddItems:0=Menu item

[ReplaceDialog]
ButtonCancel=Cancel
ButtonFind=&Find
ButtonReplaceAll=&Replace all
Caption=Replace
ComboBoxSearchFor=Search for
GroupBoxOptions=Options
GroupBoxReplaceIn=Replace in
RadioButtonAllOpenFiles=All open files
RadioButtonDeleteLine=Delete line
RadioButtonReplaceWith=Replace with
RadioButtonWholeFile=Whole file
StickyLabelCaseSensitive=Case sensitive
StickyLabelPromptOnReplace=Prompt on replace
StickyLabelSelectedOnly=Selected only
StickyLabelWholeWordsOnly=Whole words only
ActionSearchEngine=Select search engine
GroupBoxDirection=Direction
RadioButtonDirectionForward=Forward
RadioButtonDirectionBackward=Backward
GroupBoxOrigin=Origin
RadioButtonOriginFromCursor=From cursor
RadioButtonEntireScope=Entire scope

[SkinSelectDialog]
PanelPreviewArea=Preview area
GroupBoxSkinColorization=Skin colorization
LabelHueOffset=HUE Offset
LabelSaturation=Saturation
LabelBrightness=Brightness
StickyLabelExtendedBordersMode=Extended borders mode
StickyLabelBlendOnMove=Blend a form when moved
StickyLabelAllowAeroBlurring=Allow aero blurring
StickyLabelAllowAnimation=Allow animation
StickyLabelAllowGlowing=Allow glowing
StickyLabelAllowOuterEffects=Allow outer effects

[ConvertForm]
Caption=Convert between numerical units
ComboBoxFrom=From
ComboBoxTo=To       
ComboBoxType=Type
EditResult=Result
EditValue=Value

[PrintPreviewDialog]
ActionColors:h=Toggle colors
ActionColors=Colors
ActionExit:h=Exit the print preview
ActionExit=Exit
ActionFirst:h=First|Go to first page
ActionFirst=First
ActionHighlight:h=Toggle highlight
ActionHighlight=Highlight
ActionLast:h=Last|Go to last page
ActionLast=Last
ActionLineNumbers:h=Toggle line numbers
ActionLineNumbers=Line Numbers
ActionNext:h=Next|Go to next page
ActionNext=Next
ActionPrevious:h=Previous|Go to previous page
ActionPrevious=Previous
ActionPrint:h=Print|Print the document
ActionPrint=Print
ActionWordWrap:h=Toggle word wrap
ActionWordWrap=Word wrap
ActionZoom:h=Zoom|Zoom in/out
ActionZoom=Zoom
ActionZoomIn:h=Zoom in
ActionZoomIn=Zoom in
ActionZoomOut:h=Zoom out
ActionZoomOut=Zoom out
Caption=Print Preview

[SearchForFilesForm]
Caption=Search for files
PanelSearchingFiles=Searching files...

[CompareFrame]
CopySelectionLeftAction:h=Copy the selection to left
CopySelectionRightAction:h=Copy the selection to right
FindNextDifferenceAction:h=Find the next difference
LeftDocumentButtonClickAction:h=Open a document
LeftLabel=Left row
OpenDocumentsLeftAction:h=Open a document
OpenDocumentsRightAction:h=Open a document
RefreshAction:h=Refresh documents
RightDocumentButtonClickAction:h=Open a document
RightLabel=Right row
SaveLeftGridAction:h=Save the document
SaveRightGridAction:h=Save the document

[OptionsCompareFrame]
StickyLabelIgnoreCase=Ignore case
StickyLabelIgnoreBlanks=Ignore blanks

[OptionsEditorCaretFrame]
StickyLabelNonblinkingCaretEnabled=Enabled
StickyLabelRightMouseClickMovesCaret=Right mouse click moves caret
StickyLabelVisible=Visible
ColorBoxNonblinkingCaretBackground=Background color
ColorBoxNonblinkingCaretForeground=Foreground color
ComboBoxStylesInsertCaret=Insert
ComboBoxStylesOverwriteCaret=Overwrite
GroupBoxNonBlinkingCaret=Non-blinking caret
GroupBoxStyles=Styles

[OptionsEditorCodeFoldingFrame]
StickyLabelFoldMultilineComments=Fold multiline comments
StickyLabelHighlightIndentGuides=Highlight indent guides
StickyLabelHighlightMatchingPair=Highlight matching pair
StickyLabelShowCollapsedCodeHint=Show collapsed code hint
StickyLabelShowCollapsedLine=Show collapsed line
StickyLabelShowIndentGuides=Show indent guides
StickyLabelShowTreeLine=Show tree line
StickyLabelUncollapseByHintClick=Uncollapse by hint click
StickyLabelVisible=Visible
ComboBoxMarkStyle=Mark style
EditHintRowCount=Hint row count

[OptionsEditorColorFrame]
StickyLabelElementsAttributesBold=Bold
StickyLabelElementsAttributesItalic=Italic
StickyLabelElementsAttributesUnderline=Underline
StickyLabelSkinActiveLineBackground=Active line background
StickyLabelSkinBackground=Background
StickyLabelSkinBookmarkPanelBackground=Bookmark panel background
StickyLabelSkinCodeFoldingBackground=Code folding background
StickyLabelSkinCodeFoldingHintBackground=Code folding hint background
StickyLabelSkinCompletionProposalBackground=Completion proposal background
StickyLabelSkinCompletionProposalSelectionBackground=Completion proposal selection background
StickyLabelSkinForeground=Foreground
StickyLabelSkinLeftMarginBackground=Left margin background
StickyLabelSkinSelectionBackground=Selection background
StickyLabelSkinSelectionForeground=Selection foreground
ColorComboBoxEditorColor=Color
ColorComboBoxElementsBackground=Background
ColorComboBoxElementsForeground=Foreground
ComboBoxColor=Color
ComboBoxEditorElement=Element
ComboBoxElementsName=Name
ComboBoxHighlighter=Highlighter
DateEditDate=Date
EditEmail=Email
EditName=Name
EditVersion=Version
GroupBoxAttributes=Attributes
LabelSkinDescription=Use skin color for selected elements
TabSheetAuthor=Author
TabSheetEditor=Editor
TabSheetElements=Elements
TabSheetGeneral=General
TabSheetUseSkinColor=Use skin color

[OptionsEditorCompletionProposalFrame]
StickyLabelCaseSensitive=Case sensitive
StickyLabelEnabled=Enabled
StickyLabelAutoInvoke=Auto invoke
ComboBoxShortcut=Shortcut

[OptionsEditorFontFrame]
ComboBoxColor=Color
ComboBoxElement=Element
EditFontSize=Font size
FontComboBoxFont=Font

[OptionsEditorLeftMarginFrame]
StickyLabelAutoSize=Auto size
StickyLabelShowAfterLastLine=Show after last line
StickyLabelShowBookmarkPanel=Show bookmark panel
StickyLabelShowBookmarks=Show bookmarks
StickyLabelShowInTens=Show in tens
StickyLabelShowLeadingZeros=Show leading zeros
StickyLabelShowLineState=Show line state
StickyLabelVisible=Visible
EditLineNumbersStartFrom=Start from
EditBookmarkPanelWidth=Bookmark panel width
EditWidth=Width
GroupBoxLineNumbers=Line numbers
ColorComboBoxBookmarkLineColor=Bookmark line color

[OptionsEditorMatchingPairFrame]
StickyLabelEnabled=Enabled
StickyLabelHighlightAfterToken=Highlight after token
StickyLabelHighlightUnmatched=Highlight unmatched

[OptionsEditorMinimapFrame]
StickyLabelVisible=Visible
StickyLabelShowBookmarks=Show bookmarks
StickyLabelShowBorder=Show border
StickyLabelShowIndentGuides=Show indent guides
StickyLabelShowSearchResults=Show search results
StickyLabelShowShadow=Show shadow
StickyLabelUseBlending=Use blending
StickyLabelInvertBlending=Invert blending
ComboBoxAlign=Align
EditWidth=Width

[OptionsEditorOptionsFrame]
StickyLabelAutoIndent=Auto indent
StickyLabelAutoSave=Auto save
StickyLabelDragDropEditing=Drag drop editing
StickyLabelDropFiles=Drop files
StickyLabelGroupUndo=Group undo
StickyLabelTrimTrailingSpaces=Trim trailing spaces
StickyLabelUndoAfterSave=Undo after save
EditLineSpacing=Line spacing
EditClipboardHistoryItemsCount=Clipboard history items count

[OptionsEditorRightMarginFrame]
StickyLabelVisible=Visible
StickyLabelAutoLineBreak=Auto line break
StickyLabelMouseMove=Mouse move
StickyLabelShowMovingHint=Show moving hint
EditPosition=Position

[OptionsEditorScrollFrame]
StickyLabelAutosizeMaxWidth=Autosize max width
StickyLabelHalfPage=Half page
StickyLabelHintFollows=Hint follows
StickyLabelPastEndOfFile=Past end of file
StickyLabelPastEndOfLineMarker=Past end of line marker
StickyLabelShowHint=Show hint
StickyLabelShowShadow=Show shadow

[OptionsEditorSearchFrame]
StickyLabelVisible=Visible
StickyLabelClearWhenClosed=Clear when closed
StickyLabelDocumentSpecificSearch=Document-specific search
StickyLabelShowSearchMap=Show search map
ComboBoxAlign=Align

[OptionsEditorSelectionFrame]
StickyLabelVisible=Visible
StickyLabelALTSetsColumnMode=ALT sets column mode
StickyLabelExpandRealNumbers=Expand real numbers
StickyLabelHighlightSimilarTerms=Highlight similar terms
StickyLabelTermsCaseSensitive=Terms case-sensitive
StickyLabelFromEndOfLine=From end of line
StickyLabelToEndOfLine=To end of line
StickyLabelToEndOfLastLine=To end of last line
StickyLabelTripleClickRowSelect=Triple-click row select

[OptionsEditorSpecialCharsFrame]
StickyLabelUseTextColor=Use text color
StickyLabelUseMiddleColor=Use middle color
ColorComboBoxColor=Color
ComboBoxStyle=Style
GroupBoxEndOfLine=End of line
StickyLabelEndOfLineVisible=Visible
GroupBoxEndOfLine=Color
ComboBoxEndOfLineStyle=Style
GroupBoxSelection=Selection
StickyLabelSelectionVisible=Visible
ColorComboBoxSelectionColor=Color

[OptionsEditorSyncEditFrame]
StickyLabelEnabled=Enabled
StickyLabelCaseSensitive=Case sensitive
StickyLabelShowActivateIcon=Show activate icon

[OptionsEditorTabulatorFrame]
StickyLabelSelectedBlockIndent=Selected block indent
StickyLabelTabsToSpaces=Tabs to spaces
StickyLabelColumns=Columns
StickyLabelPreviousLineIndent=Previous line indent
EditWidth=Width

[OptionsEditorWordWrapFrame]
ComboBoxWidth=Width

[OptionsMainMenuFrame]
StickyLabelUseSystemFont=Use system font
FontComboBoxFont=Font
EditFontSize=Font size

[OptionsOutputFrame]
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowCheckBox=Show check box
StickyLabelUseExplorerTheme=Use explorer theme
EditIndent=Indent

[OptionsPrintFrame]
ComboBoxDocumentName=Document name
ComboBoxPageNumber=Page number
ComboBoxPrintedBy=Printed by
ComboBoxDateTime=Date time
StickyLabelShowHeaderLine=Show header line
StickyLabelShowFooterLine=Show footer line
StickyLabelShowLineNumbers=Show line numbers
StickyLabelWordWrap=Word wrap

[OptionsSQLAlignmentsFrame]
ComboBoxKeywordAlign=Keyword align
StickyLabelKeywordAlignmentLeftJustify=Keyword alignment strict left

[OptionsSQLCapitalizationFrame]
ComboBoxKeywords=Keywords
ComboBoxIdentifier=Identifier
ComboBoxQuotedIdentifier=Quoted identifier
ComboBoxTableName=Table name
ComboBoxColumnName=Column name
ComboBoxAliasName=Alias name
ComboBoxVariableName=Variable name
ComboBoxFunctionName=Function name
ComboBoxDataType=Data type

[OptionsSQLFormatterFrame]
ComboBoxDatabase=Database

[OptionsSQLIndentationFrame]
EditIndentLength=Indent length
StickyLabelUseTab=Use tab
EditTabSize=Tab size
EditFunctionBodyIndent=Function body indent
StickyLabelBlockOnNewLine=Block on new line
EditBlockLeftIndentSize=Block left indent size
EditBlockRightIndentSize=Block right indent size
EditBlockIndentSize=Block indent size
EditSingleStatementIndent=IF/ELSE single statement indent size

[OptionsSQLInsertFrame]
ComboBoxColumnListStyle=Column list style
ComboBoxValueListStyle=Value list style
EditInsertColumnsPerLine=Insert columns per line
StickyLabelParenthesisInSeparateLines=Parenthesis in separate lines

[OptionsSQLSelectFrame]
TabSheetColumnList=Column list
TabSheetSubquery=Subquery
TabSheetIntoClause=INTO clause
TabSheetFromJoinClause=FROM/JOIN clause
TabSheetAndOrKeyword=AND/OR keyword
TabSheetGroupByClause=GROUP BY clause
TabSheetHavingClause=HAVING clause
TabSheetOrderByClause=ORDER BY clause
ComboBoxColumnListStyle=Style
ComboBoxColumnListLineBreak=Line break
StickyLabelAlignAlias=Align alias
StickyLabelColumnInNewLine=Columns in new line
StickyLabelTreatDistinctAsVirtualColumn=Treat DISTINCT as virtual column
StickyLabelNewLineAfterIn=New line after IN
StickyLabelNewLineAfterExists=New line after EXISTS
StickyLabelNewlineAfterComparisonOperator=New line after comparison operator
StickyLabelNewlineBeforeComparisonOperator=New line before comparison operator
StickyLabelIntoClauseInNewLine=INTO clause in new line
ComboBoxFromClauseStyle=Style
StickyLabelFromClauseInNewLine=FROM clause in new line
StickyLabelJoinClauseInNewLine=JOIN clause in new line
StickyLabelAlignJoinWithFromKeyword=Align JOIN with FROM keyword
StickyLabelAlignAndOrWithOnInJoinClause=Align AND/OR with ON in JOIN clause
StickyLabelAlignAliasInFromClause=Align alias in FROM clause
ComboBoxAndOrLineBreak=Line break
StickyLabelAndOrUnderWhere=AND/OR under WHERE
StickyLabelWhereClauseInNewline=WHERE clause in new line
StickyLabelWhereClauseAlignExpr=WHERE clause align expr
ComboBoxGroupByClauseStyle=Style
StickyLabelGroupByClauseInNewLine=GROUP BY clause in new line
StickyLabelHavingClauseInNewLine=HAVING clause in new line
ComboBoxOrderByClauseStyle=Style
StickyLabelOrderByClauseInNewLine=ORDER BY clause in new line

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=Column list style

[OptionsSQLWhitespaceFrame]
StickyLabelSpaceAroundOperator=Space around operator of arithmetric expression
StickyLabelSpaceInsideCreate=Space inside parenthesis in CREATE FUNCTION/PROCEDURE
StickyLabelSpaceInsideExpression=Space inside parenthesis in expression
StickyLabelSpaceInsideSubquery=Space inside parenthesis in subquery
StickyLabelSpaceInsideFunction=Space inside parenthesis in function call
StickyLabelSpaceInsideTypename=Space inside parenthesis of typename in CREATE TABLE

[OptionsStatusBarFrame]
StickyLabelUseSystemFont=Use system font
FontComboBoxFont=Font
EditFontSize=Font size
StickyLabelShowMacro=Show macro
StickyLabelShowCaretPosition=Show caret position
StickyLabelShowKeyState=Show key state
StickyLabelShowModified=Show modified

[OptionsToolbarFrame]
VirtualDrawTree:h=Use drag and drop to move menu items. Right click popup menu to insert and delete items.
VirtualDrawTree:0=Menu item
ActionAddItem=Add item
ActionAddItem:h=Add item
ActionDelete=Delete
ActionDelete:h=Delete
ActionAddDivider=Add divider
ActionAddDivider:h=Add divider
ActionReset=Reset
ActionReset:h=Reset menu items
ActionMoveUp=Move up     
ActionMoveUp:h=Move selected item up
ActionMoveDown=Move down
ActionMoveDown:h=Move selected item down

[AboutDialog]
Caption=About EditBone
LabelVersion=Version %s (%d-bit)
LabelCopyright=Copyright %s. All rights reserved.
LabelMemoryAvailable=Memory available to Windows: %s
LabelDevelopmentEnvironment=Development environment
LabelThirdPartyComponents=3rd party components
LabelLanguageFileContributors=Language file contributors
LabelIcons=Icons
ButtonDonations=Donations
ButtonOK=OK

[DirectoryTabDialog]
EditTabName=Tab name
EditRootDirectory=Root directory
GroupBoxOptions=Options
ComboBoxDrives=Drives
ComboBoxFileMask=File mask
StickyLabelExcludeOtherBranches=Exclude other directory branches
ButtonCancel=Cancel
ButtonOK=&OK

[LanguageEditorForm]
ActionFileNew=New
ActionFileNew:h=Create a new language file
ActionFileOpen=Open
ActionFileOpen:h=Open an existing language file
ActionFileSave=Save
ActionFileSave:h=Save the language file
ActionExit=Exit
ActionExit:h=Close the language editor
VirtualDrawTree:0=Object
VirtualDrawTree:1=Caption
VirtualDrawTree:2=Hint
VirtualDrawTree:3=Shortcut

[OptionsForm]
ActionCompare=Compare files
ActionDirectory=Directory
ActionDirectoryTabs=Tabs
ActionEditor=Editor
ActionEditorCaret=Caret
ActionEditorCodeFolding=Code folding
ActionEditorColors=Colors
ActionEditorCompletionProposal=Completion proposal
ActionEditorDefaults=Defaults
ActionEditorFonts=Font
ActionEditorLeftMargin=Left margin
ActionEditorMatchingPair=Matching pair
ActionEditorMinimap=Minimap
ActionEditorRightMargin=Right margin
ActionEditorScroll=Scroll
ActionEditorSearch=Search
ActionEditorSelection=Selection
ActionEditorSpecialChars=Special chars
ActionEditorSyncEdit=Sync edit
ActionEditorTabs=Tabs
ActionEditorTabulator=Tabulator
ActionEditorWordWrap=Word wrap
ActionFileTypes=File types
ActionMainMenu=Main menu
ActionOutput=Output
ActionOutputTabs=Tabs
ActionPrint=Print
ActionStatusBar=Status bar
ActionTitleBar=Title bar
ActionSQLAlignments=Alignments
ActionSQLCapitalization=Capitalization
ActionSQLFormatter=SQL Formatter
ActionSQLIndentation=Indentation
ActionSQLInsert=Insert
ActionSQLSelect=Select
ActionSQLUpdate=Update
ActionSQLWhitespace=Whitespace
ActionToolbar=Toolbar
ButtonCancel=Cancel
ButtonOK=&OK
Caption=Options

[UnicodeCharacterMapForm]
Caption=Unicode Character Map

[OptionsDirectoryFrame]
StickyLabelAutoHide=Auto hide
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowHiddenFiles=Show hidden files
StickyLabelShowSystemFiles=Show system files
StickyLabelShowArchiveFiles=Show archive files
StickyLabelShowOverlayIcons=Show overlay icons
StickyLabelUseExplorerTheme=Use explorer theme
EditIndent=Indent
ComboBoxAlign=Align

[OptionsDirectoryTabsFrame]
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelMultiline=Multiline
StickyLabelSaveTabs=Save tabs
StickyLabelShowCloseButton=Show close button
StickyLabelShowOpenDirectoryButton=Show open directory button
StickyLabelShowImage=Show image
StickyLabelRightClickSelect=Right click select

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Color
ComboBoxDefaultEncoding=Encoding
ComboBoxDefaultHighlighter=Highlighter
ComboBoxDefaultSQLHighlighter=SQL highlighter
EditBrowser=Browser

[OptionsEditorTabsFrame]
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelMultiline=Multiline
StickyLabelRightClickSelect=Right click select
StickyLabelSaveTabs=Save Tabs
StickyLabelShowCloseButton=Show close button
StickyLabelShowImage=Show image

[OptionsFileTypesFrame]
EditExtensions=Extensions
VirtualDrawTree:0=File type

[OptionsOutputTabsFrame]
StickyLabelMultiline=Multiline
StickyLabelShowCloseButton=Show close button
StickyLabelShowImage=Show image
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=Save tabs
StickyLabelRightClickSelect=Right click select

[SQLFormatterConstant]
Stacked=Stacked
Wrapped=Wrapped
AfterComma=After comma
BeforeComma=Before comma
BeforeCommaWithSpace=Before comma with space
NoLineBreak=No line break
BeforeAndOr=Before AND/OR
AfterAndOr=After AND/OR
Left=Left
Right=Right
None=None
Uppercase=Uppercase
Lowercase=Lowercase
SentenceCase=Sentence case
NoChange=No change

[ConvertConstant]
Distance=Distance
Micromicrons=Micromicrons
Angstroms=Angstroms
Millimicrons=Millimicrons
Microns=Microns
Millimeters=Millimeters
Centimeters=Centimeters
Decimeters=Decimeters
Meters=Meters
Decameters=Decameters
Hectometers=Hectometers
Kilometers=Kilometers
Megameters=Megameters
Gigameters=Gigameters
Inches=Inches
Feet=Feet
Yards=Yards
Miles=Miles
NauticalMiles=Nautical miles
AstronomicalUnits=Astronomical units
LightYears=Light years
Parsecs=Parsecs
Cubits=Cubits
Fathoms=Fathoms
Furlongs=Furlongs
Hands=Hands
Paces=Paces
Rods=Rods
Chains=Chains
Links=Links
Picas=Picas
Points=Points
Area=Area
SquareMillimeters=Square millimeters
SquareCentimeters=Square centimeters
SquareDecimeters=Square decimeters
SquareMeters=Square Meters
SquareDecameters=Square decameters
SquareHectometers=Square hectometers
SquareKilometers=Square kilometers
SquareInches=Square inches
SquareFeet=Square feet
SquareYards=Square yards
SquareMiles=Square miles
Acres=Acres
Centares=Centares
Ares=Ares
Hectares=Hectares
SquareRods=Square rods
Volume=Volume
CubicMillimeters=Cubic millimeters
CubicCentimeters=Cubic centimeters
CubicDecimeters=Cubic decimeters
CubicMeters=Cubic meters
CubicDecameters=Cubic decameters
CubicHectometers=Cubic hectometers
CubicKilometers=Cubic kilometers
CubicInches=Cubic inches
CubicFeet=Cubic feet
CubicYards=Cubic yards
CubicMiles=Cubic miles
MilliLiters=Milli liters
CentiLiters=Centi liters
DeciLiters=Deci liters
Liters=Liters
DecaLiters=Deca liters
HectoLiters=Hecto liters
KiloLiters=Kilo liters
AcreFeet=Acre feet
AcreInches=Acre inches
Cords=Cords
CordFeet=Cord feet
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=Fluid gallons
FluidPints=Fluid pints
FluidQuarts=Fluid quarts
FluidCups=Fluid cups
FluidGills=Fluid gills
FluidOunces=Fluid ounces
FluidTablespoons=Fluid tablespoons
FluidTeaspoons=Fluid teaspoons
DryGallons=Dry gallons
DryQuarts=Dry quarts
DryPints=Dry pints
DryPecks=Dry pecks
DryBuckets=Dry buckets
DryBushels=Dry bushels
UKGallons=UK gallons
UKPottle=UK pottles
UKQuarts=UK quarts
UKPints=UK pints
UKGill=UK gills
UKOunces=UK ounces
UKPecks=UK pecks
UKBuckets=UK buckets
UKBushels=UK bushels
Mass=Mass
Nanograms=Nanograms
Micrograms=Micrograms
Milligrams=Milligrams
Centigrams=Centigrams
Decigrams=Decigrams
Grams=Grams
Decagrams=Decagrams
Hectograms=Hectograms
Kilograms=Kilograms
MetricTons=Metric tons
Drams=Drams
Grains=Grains
LongTons=Long tons
Tons=Tons
Ounces=Ounces
Pounds=Pounds
Stones=Stones
NumeralSystem=Numeral system
Binary=Binary
Decimal=Decimal
Hexadecimal=Hexadecimal
Temperature=Temperature
Celsius=Celsius
Kelvin=Kelvin
Fahrenheit=Fahrenheit
Time=Time
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=Milli seconds
Seconds=Seconds
Minutes=Minutes
Hours=Hours
Days=Days
Weeks=Weeks
Fortnights=Fortnights
Months=Months
Years=Years
Decades=Decades
Centuries=Centuries
Millennia=Millennia
DateTime=Date time
JulianDate=Julian date
ModifiedJulianDate=Modified Julian date